[M_DefendSlabTower MissionDefinition]
MissionName="Protection against fire alarm towers"
MissionDescription="Hyperion sometimes puts things in brick. The company plans to send a small group of robots to intercept or destroy one of the missions, and Brick asks you to protect them.."
TurnInDescription="You saved the Hyperion software and downloaded the content. If these groups don't apply to you, you will be greatly appreciated and respected at Tagus.."
MissionSummary="Provide trademark protection."
MissionGiver="Stop yourself."
MissionTurnInLocation="Hyperion Power Supply"
TeaserText="Guard the palace!"

[M_DefendSlabTower:DefendCrateSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_DefendSlabTower:DefendSupplyCrate MissionObjectiveDefinition]
ProgressMessage="Register a distribution box"

[M_DefendSlabTower:GetInCommandTurret MissionObjectiveDefinition]
ProgressMessage="Go to the command tower"

[M_DefendSlabTower:GetInCommandTurretSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_DefendSlabTower:GrabBeacons MissionObjectiveDefinition]
ProgressMessage="Take the staff of the Tajos lighthouse."

[M_DefendSlabTower:GrabBeaconsSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_DefendSlabTower:PlaceGoliathBeacon MissionObjectiveDefinition]
ProgressMessage="Throw Goliath's lamp."

[M_DefendSlabTower:PlaceGoliathBeaconSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_DefendSlabTower:PlaceMarauderBeacon MissionObjectiveDefinition]
ProgressMessage="Prowler lighting installation"

[M_DefendSlabTower:PlaceMarauderBeaconSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_DefendSlabTower:PlacePsycoBeacon MissionObjectiveDefinition]
ProgressMessage="Bring the psychiatrist to the candlestick"

[M_DefendSlabTower:PlacePsycoBeaconSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

